/**********************************************************************************************************************
*                                        (c) COPYRIGHT by ZAO RCZI Fort.                                          *
*                                               All rights reserved.                                                  *
***********************************************************************************************************************
* Module      : с8051_f902_delay.h
* Description : Работа с Задержками и Описание Параметров нашей Системы.
* Author      : Konstantin Shiluaev
******************************************************************************
******************************************************************************
* Module's Description Record:
* ============================
* $State: Debug$
* $Revision: 0.0.0 $
* $Date: 2015/03/02 10:40:51 $
******************************************************************************/
#ifndef __C8051_F902_DELAY_H
#define __C8051_F902_DELAY_H


          //////////Параметры Системы нашей//////////



          //Частота CPU C8051_F902   
          #define   SYSCLK          24500000L    //24.5 [МгЦ]
          //I2C Frequency 100 Khz (100000hz)
		  #define SMB_FREQUENCY     100000 		 //Частота Работы шины I2C  _100 [Кгц]
          //SPI CLK Frequency 500 Khz
          #define SPI_CLOCK         500000       //Частота Работы шины SPI  _500 [Кгц]
         

//
//#ifdef __cplusplus
//extern "C" {
//#endif


   /*  CPU C8051F902  SYSCLK = 24.5 [Мгц] = 24 500 000 [Гц]  TIMER_16_bit = 0xFFFF = 65535
    *  
    *  -----------------------------------------------------------------------------------------------------
    *  Временной предел таймера.
	*  0x0001 = 1 тик      [процессорных_циклов]  частота_sysclk = 24.5 [Мгц] = 24 500 000 [Гц]
	*  время 1 прерывания = 4.081632653 * 10 -8 [c]  = 0.041 [мКс]
	*  0xFFFF = 65535 тиков[процессорных_циклов]  частота_hclk = 24.5 [Мгц]   = 24 500 000 [Гц]
    *  время 1 прерывания = 0.00267489 [c] = 2.67489 [мс] //24.5 [Мгц]
    *                       
    * 
    *  //Устанаваливаем время прерывания 1[мс] и 1 [мкс]
    *  Для того чтобы у нас считали одинаково таймеры для DSP и RISC количество процессорных циклов = 0x5FB4 = 24500
    *  частота_hclk = 24.5 [Мгц] = 24 500 000 [Гц]
    *
    *  время 1 прерывания = 0.001 [c] =    1 [мс] //24.5 [Мгц]
    *  
	*
	*
	*  Для того чтобы у нас считали одинаково таймеры для DSP и RISC количество процессорных циклов = 0x0018 = 24
    *  время 1 прерывания = 0.000001 [c] = 1 [мКс] //24 [Мгц]
    *
    *  задержки(delay):
    *
    *
    *  приблизительная формула для подсчёта: время[с] = [Процессорные циклы] /[частоту]
    *  максимум =  16 777 215 тиков   = 0.699 [секунд]  при 24 [Мгц]
    *
    *  приблизительная формула для подсчёта: время[с] = [Процессорные циклы] /[частоту]
    *  максимум =  65535 тиков   = 0.002730625 [секунд]  при 24 [Мгц]
    *              24000 тиков   = 0.001 [секунд]  =1 [мс] при 24 [Мгц]
    */

 /////////////////////////////////////РАБОТА с ТАЙМЕРОМ/////////////////////////////////////////////
/*Соотношение между названиями регистров Фитон <-> Миландр Системного Таймера SYSTICK*/
// SYS->STRVR     <<<->>>   SysTick->LOAD
// SYS->STCSR     <<<->>>   SysTick->CTRL
// SYS->STCVR     <<<->>>   SysTick->VAL   текущее значение системного таймера





/*Как 24 разрядный таймер разрешение*/
//Базовые времна которые можем получить с помощью таймера от которого буду работать.
//для частоты 8  Мгц   1[cек]    =(0x7A1200)8000000 [ticks] ,1[мс]  = 0x1F40 (8000) [ticks] , 1[мкс] =0x0008(8) [ticks]
//для частоты 24 Мгц   0.5[cек]  =(0xB71B00)12000000[ticks] ,1[мс]  = 0x5DC0 (24000)[ticks] , 1[мкс] =0x0018(24)[ticks]




//для частоты 96 Мгц   0.125[cек]=(0xB71B00)12000000[ticks] ,1[мс]  = 0x17700(96000)[ticks] , 1[мкс] =0x0060(96)[ticks]

//Производные времена.                /*количество повторений*/
//для частоты 24  Мгц   1[сек] = 0.5[сек]  * (2);
//для частоты 96  Мгц   1[сек] = 0.125[сек]* (8);



 ///////////////////////////Работа Системного Таймера/////////////////////////////////
 /*
 в зависимости от выбранной частоты процессора тактирование таймера осуществляеться от HCLK=CPUC3 т.е работает с
 частотой процессора в текущий момент работаем на частоте 24 мГц тогда если мы разрешаем прерывание от системного
 таймера одно прерывание соответсвенно 1 микросекунда =1 прерывние;1 миллисекунда = 1 прерывание ; 0.5 секунд =1 прерывние.
  */
 //

void Wait_MS_timer2(unsigned int ms);
void Wait_Sec_timer2(unsigned int second);

//Функции работы с временем вспомогательные
/*функция задержки в количестве while */
void  while_delay(unsigned long counter);
/*функция задержки системного таймера в тиках 0-16 777 215  при частоте 24 или 96 мГц */
//void  sys_timer_delay_ticks(unsigned int ticks);                   //
void test_delay();


void Timer1_Init();  //Таймер_1 для I2C Шины




/*функция взять текущий тик*/
//unsigned int sys_timer_get_tick(void);
/*функция задержки Секунды[1-60 сек]*/
//void sys_timer_second_delay (unsigned short second);


/*функция задержки Миллисекунды[1-1000 сек]*/
//void sys_timer_millisecond_delay (unsigned short millisecond);


/*функция задержки Микросекунды[1-1000 сек]
* Пока функция задержки реализована с разрешением 10 мКс 
* Те если мы вводим значение 1 то умножаем его  * 10 = 10 мкС 
* соответсвенно 2 * 10 = 20 	  мКс 
*               3 * 10= 30 	    мКс
                4 * 10= 40      мКс 
                68* 10 = 680    мКС 
                100 * 10 = 1000 мкс 
*/
//void sys_timer_microsecond_delay (unsigned short microsecond);

/*берём текущее количество тиков из регистра*/
//unsigned int sys_timer_getCounter(void);                         


 //Другие функции
//#ifdef __cplusplus
//}
//#endif




#endif //__C8051_F902_DELAY_H






