/**********************************************************************************************************************
*                                        (c) COPYRIGHT by ZAO RCZI Fort.                                          *
*                                               All rights reserved.                                                  *
***********************************************************************************************************************
* Module      : C8051_F902_SPI.h
* Description : Работа с шиной SPI КН-019 C8051_f902 Интерфейсные функции
* Author      : Konstantin Shiluaev
******************************************************************************
******************************************************************************
* Module's Description Record:
* ============================
* $State: Debug$
* $Revision: 0.0.0 $
* $Date: 2015/03/02 10:40:51 $
******************************************************************************/
#ifndef __C8051_F902_SPI_H
#define __C8051_F902_SPI_H


void SPI1_Init ();
void SPI1_ISR  ();


//В нашем C8051F902 шина SPI работает только по байтно.по иному нельщя скогфигурировать её.!
//Внимание на получение данных с KSZ8765 стоит инвертор те в регистрах проца нужно ивертировать наоборот.!!!


//Пока здесь сделаем работу с KSZ свитчом!! потом перенесу в отдельный файл
void spi_ksz8765_readreg (const unsigned char *reg_addr,unsigned char *out_reg_val);      //чтение из  KSZ8765
//void spi_ksz8765_writereg(const unsigned char *reg_addr,const unsigned char *in_reg_addr);//запись из  KSZ8765


//Тестовые Функции Использовать Можно но потом сделаю получше
//void SPI1_Byte_Write (unsigned char dat);   //Запись Байта
//unsigned char SPI1_Byte_Read ();            //Чтение Байта

//Пишем и читаем массив данных из KSZ8765
//void SPI_Array_Write ();
//void SPI_Array_Read (void);

#endif //__C8051_F902_SPI_H






