 /**********************************************************************************************************************
*                                        (c) COPYRIGHT by PAO Inteltech.                                             *
*                                               All rights reserved.                                                  *
***********************************************************************************************************************
* Module      : bky_arm_delay.c
* Description : ‘ункции –аботы с задержками и “аймеры
* Author      : Konstantin Shiluaev
******************************************************************************
******************************************************************************
* Module's Description Record:
* ============================
* $State: Debug$
* $Revision: 0.0.1 $
* $Description: ѕерва€ ревизи€ блока работы с «адержками дл€ 96 [мг÷]
* $Date: 2016/08/31 10:40:51 $
* $Revision: 0.0.2 $
*
*
******************************************************************************/

//------------------------------------------------------------------------------------------------------------------  
#include <compiler_defs.h>    
#include <C8051F912_defs.h>



#include <c8051_f902_delay.h>





/*****************************************************************************/
/*  PRIVATE FUNCTIONS                                                        */
/*****************************************************************************/




//-------------------------------------------------------------------------------------------------------------------





///////////////////–абота с —истемным “аймером////////////////////
/**************************************************************************************************
Parameters:         void sys_timer_start_en_irq(uint8_t second)
Remarks:            стартуем системный таймер с генерацией прерывани€
***************************************************************************************************/


/**************************************************************************************************
Parameters:         void sys_timer_start_dis_irq(uint16_t  millisecond)
Remarks:            стартуем системный таймер без прерывани€
***************************************************************************************************/


/**************************************************************************************************
Parameters:         void sys_timer_stop ()
Remarks:            останавливаем системный таймер
***************************************************************************************************/


/**************************************************************************************************
Parameters:         void sys_timer_second_delay ()
Remarks:            возвращаем значение текущего тика из регистра
Description:        ¬ данной функции вводим задржку от 1 до 60 секунд
***************************************************************************************************/



/**************************************************************************************************
Parameters:         void sys_timer_millisecond_delay ()
Remarks:            возвращаем значение текущего тика из регистра
Description:        ¬ данной функции вводим задржку от 1 до 1000 миллисекунд
***************************************************************************************************/


/**************************************************************************************************
Parameters:         void sys_timer_microsecond_delay ()
Remarks:            возвращаем значение текущего тика из регистра
* 									ѕока функци€ задержки реализована с разрешением 2 м с  дл€ частоты ÷ѕ” = 96 [мг÷] 
* 									—оответсвенно  in 1 *2    = 2[м с]
                    —оответсвенно  in 2 *2    = 4[м с]
                    —оответсвенно  in 10 *2   =20[м с]
                    —оответсвенно  in 12 *2   =24[м с]
                    —оответсвенно  in 25 *2   =50[м с]
                    —оответсвенно  in 98 *2   = 196[м с]
                    —оответсвенно  in 231 *2  = 462[м с]
                    —оответсвенно  in 342 *2  = 684[м с]
                    —оответсвенно  in 500 *2  = 1000[м с]
***************************************************************************************************/

/*******************************************************************************
* Function Name  : SysTick_GetCounter
* Description    : Gets SysTick counter value.
* Input          : None
* Output         : None
* Return         : SysTick current value
*******************************************************************************/


/////////////////////////////////////‘ункции –еализации «адержки///////////////////////////////
//-----------------------------------------------------------------------------
// Wait_MS
//-----------------------------------------------------------------------------
//
// Return Value : None
// Parameters:
//   1) unsigned int ms - number of milliseconds of delay
//                        range is full range of integer: 0 to 65335
// This routine inserts a delay of <ms> milliseconds.
// [16-bit auto-reload mode] _ timer2  - >> [T2SPLIT_bit=0] TIMER_2_CN p.289
// use SYSCLK 24500 
//
//
//
//-----------------------------------------------------------------------------
void Wait_MS_timer2(unsigned int ms)     //for 0 = 8 [мкс]
{
     CKCON = 0x10;                       //Timer use System CLK 24.5[Mhz]


    //TMR2RL_ =   Timer_2 Reload  16 bit value  
    //TMR2    =   Timer_2 Counter 16 bit value
                                                         //60000 - [1 мс  !!Succesful!!]
     TMR2RL=60000;//61554;//20518; //41036;              //20518 - [8 мс] //61554 - [700 м с] //64000 - 280[м с] //65000 - 110[м с] //65400 - 36[м с]
     TMR2 = TMR2RL;                                      //65500 - [16 м с] -- наступает предел GPIO pin

     ET2 = 0;                             // Disable Timer 2 interrupts
     TR2 = 1;                             // Start Timer 2

	 while(ms)
	 {
	      TF2H = 0;                         // Clear flag to initialize
	      while(!TF2H);                     // Wait until timer overflows
	      ms--;                             // Decrement ms
	 }

	 TR2 = 0;                               // Stop Timer 2
 
}
/*******************************************************************************
* Function Name  : SysTick_GetCounter
* Description    : Gets SysTick counter value.
* Input          : None
* Output         : None
* Return         : SysTick current value
*******************************************************************************/
void Wait_Sec_timer2(unsigned int second)
{

	 CKCON = 0x10;                       			//Timer use System CLK 24.5[Mhz]
    //TMR2RL_ =   Timer_2 Reload  16 bit value  
    //TMR2    =   Timer_2 Counter 16 bit value
                                                    //60000 - [1 мс  !!Succesful!!]
     TMR2RL=10;//1000;//20000;//60000;                  //10000 = 10 [мс]        //20000 - [8 мс  !!Succesful!!]
     TMR2 = TMR2RL;                                  //1000 - 12 [мс]    

     ET2 = 0;                             // Disable Timer 2 interrupts
     TR2 = 1;                             // Start Timer 2

	 while(second)
	 {
	      TF2H = 0;                         // Clear flag to initialize
	      while(!TF2H);                     // Wait until timer overflows
	      second--;                             // Decrement ms
	 }

	 TR2 = 0;                               // Stop Timer 2

}




/**************************************************************************************************
Parameters:  void while_delay(uint32_t  counter);       
Remarks:    //ѕоправки к вызовам функций при разных значени€х (входа)  cколько стоит 1 while                                         
																				    //while						 [24 ћгц]                	множитель *7	[168 ћг÷]
 																					//1    =    	   ~1 мкс      -          		   ~ 160  [нс]
																					//10   =    	   ~3 мкс      -
																					//100  =    	   ~20 мкс     -          			
																					//500  =  	       ~80 мкс     -                  
																					//800  =  	     ~140 мкс    -
																					//1000 =  	     ~170 мкс    -                  ~   24 [мкс]

																					//если нужны нано секунды то используем этот таймер по while
																					// -  множитель *4     [96 ћгц] 
																					//1 мкс = 10 [while]
																					//2 мкс = 40 [while] 

***************************************************************************************************/
void  while_delay(unsigned long counter)
{
	
	    while(counter!=0)
        {  	       
			counter--; 
		}
	
}	




//-----------------------------------------------------------------------------
// T0_Waitms
//-----------------------------------------------------------------------------
//
// Return Value : None
// Parameters   :
//   1) U8 ms - number of milliseconds to wait range is full range of character: 0 to 255
// Configure Timer0 to wait for <ms> milliseconds using SYSCLK as its time
// base.
//
//-----------------------------------------------------------------------------
/*
void T0_Waitms (unsigned int ms)
{
   TCON &= ~0x30;                      // Stop Timer0; Clear TF0
   TMOD &= ~0x0f;                      // 16-bit free run mode
   TMOD |=  0x01;

   CKCON |= 0x04;                      // Timer0 counts SYSCLKs

   while (ms)
   {
      TR0 = 0;                         // Stop Timer0
      TH0 = ((-SYSCLK/1000) >> 8);     // Overflow in 1ms
      TL0 = ((-SYSCLK/1000) & 0xFF);
      TF0 = 0;                         // Clear overflow indicator
      TR0 = 1;                         // Start Timer0
      while (!TF0);                    // Wait for overflow
      ms--;                            // Update ms counter
   }

   TR0 = 0;                            // Stop Timer0
}
*/


