 /**********************************************************************************************************************
*                                        (c) COPYRIGHT by PAO Inteltech.                                             *
*                                               All rights reserved.                                                  *
***********************************************************************************************************************
* Module      : bky_arm_delay.c
* Description : Функции Работы с задержками и Таймеры
* Author      : Konstantin Shiluaev
******************************************************************************
******************************************************************************
* Module's Description Record:
* ============================
* $State: Debug$
* $Revision: 0.0.1 $
* $Description: Первая ревизия блока работы с Задержками для 96 [мгЦ]
* $Date: 2016/08/31 10:40:51 $
* $Revision: 0.0.2 $
*
*
******************************************************************************/
//Секунды
#define timer_05sec_delay_24      0x00B71B00   //12 000 000[тиков]   = 0.5   [секунд]  при частоте  TIM_CLK1 = 24[мгц]  | Systimer[HCLK] = 24 [мгц]
#define timer_0125sec_delay_96    0x00B71B00   //12000000[тиков]     = 0.125 [секунд]  при частоте  Systimer[HCLK] = 96 [мгц]

//Миллисекунды
#define timer_1ms_delay_24        0x00005DC0   //24000 тиков       = 1 [мс]  при частоте TIM_CLK1 = 24[мгц]  | Systimer[HCLK] = 24 [мгц]
#define timer_1ms_delay_96        0x00017700   //96000 тиков       = 1 [мс]  при частоте Systimer[HCLK] = 96 [мгц]
//Микросекунды
#define timer_1mks_delay_24       0x00000018   //24    тика        = 1 [мКс] при частоте TIM_CLK1 = 24[мгц]   | Systimer[HCLK] = 24 [мгц]
#define timer_10mks_delay_24      0x000000F0   //240   тиков       = 10 [мКс] при частоте TIM_CLK1 = 24[мгц]  | Systimer[HCLK] = 24 [мгц]
#define timer_100mks_delay_24     0x00000960   //2400  тиков       = 100[мкс] при частоте TIM_CLK1 = 24[мгц]  | Systimer[HCLK] = 24 [мгц]
 
#define timer_1mks_delay_96       0x00000060  //96    тиков       1 [мКс] при частоте Systimer[HCLK] = 96 [мгц]

//------------------------------------------------------------------------------------------------------------------
#include <inc/c8051_f902_delay.h>



/*****************************************************************************/
/*  PRIVATE FUNCTIONS                                                        */
/*****************************************************************************/




//-------------------------------------------------------------------------------------------------------------------





///////////////////Работа с Системным Таймером////////////////////
/**************************************************************************************************
Parameters:         void sys_timer_start_en_irq(uint8_t second)
Remarks:            стартуем системный таймер с генерацией прерывания
***************************************************************************************************/


/**************************************************************************************************
Parameters:         void sys_timer_start_dis_irq(uint16_t  millisecond)
Remarks:            стартуем системный таймер без прерывания
***************************************************************************************************/


/**************************************************************************************************
Parameters:         void sys_timer_stop ()
Remarks:            останавливаем системный таймер
***************************************************************************************************/


/**************************************************************************************************
Parameters:         void sys_timer_second_delay ()
Remarks:            возвращаем значение текущего тика из регистра
Description:        В данной функции вводим задржку от 1 до 60 секунд
***************************************************************************************************/



/**************************************************************************************************
Parameters:         void sys_timer_millisecond_delay ()
Remarks:            возвращаем значение текущего тика из регистра
Description:        В данной функции вводим задржку от 1 до 1000 миллисекунд
***************************************************************************************************/


/**************************************************************************************************
Parameters:         void sys_timer_microsecond_delay ()
Remarks:            возвращаем значение текущего тика из регистра
* 									Пока функция задержки реализована с разрешением 2 мКс  для частоты ЦПУ = 96 [мгЦ] 
* 									Соответсвенно  in 1 *2    = 2[мКс]
                    Соответсвенно  in 2 *2    = 4[мКс]
                    Соответсвенно  in 10 *2   =20[мКс]
                    Соответсвенно  in 12 *2   =24[мКс]
                    Соответсвенно  in 25 *2   =50[мКс]
                    Соответсвенно  in 98 *2   = 196[мКс]
                    Соответсвенно  in 231 *2  = 462[мКс]
                    Соответсвенно  in 342 *2  = 684[мКс]
                    Соответсвенно  in 500 *2  = 1000[мКс]
***************************************************************************************************/

/*******************************************************************************
* Function Name  : SysTick_GetCounter
* Description    : Gets SysTick counter value.
* Input          : None
* Output         : None
* Return         : SysTick current value
*******************************************************************************/


/////////////////////////////////////Функции Реализации Задержки///////////////////////////////
/*******************************************************************************
* Function Name  : void  sys_timer_delay_ticks(unsigned int ticks)
* Description    : функция выставляет задержки в ТИКАХ системного таймера в зависимости от частоты HCLK те процессора.
* Input          : таймер 24 разрядный максимальное значение тиков 0x00FFFFFF [16 777 215]
*******************************************************************************/  




/**************************************************************************************************
Parameters:  void while_delay(uint32_t  counter);       
Remarks:    //Поправки к вызовам функций при разных значениях (входа)  cколько стоит 1 while                                         
																				    //while						 [24 Мгц]                	множитель *7	[168 МгЦ]
 																					//1    =    	   ~1 мкс      -          		   ~ 160  [нс]
																					//10   =    	   ~3 мкс      -
																					//100  =    	   ~20 мкс     -          			
																					//500  =  	       ~80 мкс     -                  
																					//800  =  	     ~140 мкс    -
																					//1000 =  	     ~170 мкс    -                  ~   24 [мкс]

																					//если нужны нано секунды то используем этот таймер по while
																					// -  множитель *4     [96 Мгц] 
																					//1 мкс = 10 [while]
																					//2 мкс = 40 [while] 

***************************************************************************************************/
void  while_delay(unsigned long counter)
{
	
	    while(counter!=0)
        {  	       
			counter--; 
		}
	
}	







